In [1]:
%load_ext sql

In [2]:
%sql postgresql://guest:Guest1234@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: guest@dev'

## 월별 세션수를 계산하는 SQL

In [3]:
%%sql

SELECT 
  LEFT(ts, 7) as mon,
  COUNT(1) AS session_count
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 1;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', 6261),
 ('2019-06', 10520),
 ('2019-07', 14840),
 ('2019-08', 17151),
 ('2019-09', 15790),
 ('2019-10', 18899),
 ('2019-11', 18059)]

## 가장 많이 사용된 채널은 무엇인가?

In [ ]:
%%sql

SELECT 
  channel,
  COUNT(1) AS session_count,
  COUNT(DISTINCT userId) AS user_count 
FROM raw_data.user_session_channel
GROUP BY 1
ORDER BY 2 DESC;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[('Youtube', 17091, 889),
 ('Google', 16982, 893),
 ('Naver', 16921, 882),
 ('Organic', 16904, 895),
 ('Instagram', 16831, 895),
 ('Facebook', 16791, 889)]

In [ ]:
%%sql

SELECT
  channel,
  COUNT(1) AS session_count,
  COUNT(DISTINCT userId) AS user_count
FROM raw_data.user_session_channel
GROUP BY channel
ORDER BY user_count DESC;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[('Instagram', 16831, 895),
 ('Organic', 16904, 895),
 ('Google', 16982, 893),
 ('Facebook', 16791, 889),
 ('Youtube', 17091, 889),
 ('Naver', 16921, 882)]

## 가장 많은 세션을 만든 사용자 아이디는 무엇인가?

In [ ]:
%%sql

SELECT
  userId,
  COUNT(1) as session_count
FROM raw_data.user_session_channel
GROUP BY 1
ORDER BY session_count DESC
LIMIT 1;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(1615, 528)]

## 월별 유니크한 사용자 수

In [ ]:
%%sql

SELECT 
  TO_CHAR(A.ts, 'YYYY-MM') AS month,
  COUNT(DISTINCT B.userId) as mau
FROM raw_data.session_timestamp A
JOIN raw_data.user_session_channel B ON A.sessionId = B.sessionId
GROUP BY 1
ORDER BY 1;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', 281),
 ('2019-06', 459),
 ('2019-07', 623),
 ('2019-08', 662),
 ('2019-09', 639),
 ('2019-10', 763),
 ('2019-11', 721)]

In [ ]:
%%sql

SELECT
  TO_CHAR(A.ts, 'YYYY-MM') AS month,
  COUNT(B.userid) AS cnt,
  COUNT(DISTINCT B.userid) AS mau
FROM raw_data.session_timestamp A
JOIN raw_data.user_session_channel B ON A.sessionId = B.sessionId
GROUP BY 1
ORDER BY 1;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', 6261, 281),
 ('2019-06', 10520, 459),
 ('2019-07', 14840, 623),
 ('2019-08', 17151, 662),
 ('2019-09', 15790, 639),
 ('2019-10', 18899, 763),
 ('2019-11', 18059, 721)]

## 월별 채널 유니크한 사용자 수

In [ ]:
%%sql

SELECT
  TO_CHAR(A.ts, 'YYYY-MM') AS month,
  channel, 
  COUNT(DISTINCT B.userId) AS mau
FROM raw_data.session_timestamp A
JOIN raw_data.user_session_channel B ON A.sessionId = B.sessionId
GROUP BY month, channel
ORDER BY month DESC, channel;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
42 rows affected.

[('2019-11', 'Facebook', 688),
 ('2019-11', 'Google', 688),
 ('2019-11', 'Instagram', 669),
 ('2019-11', 'Naver', 667),
 ('2019-11', 'Organic', 677),
 ('2019-11', 'Youtube', 677),
 ('2019-10', 'Facebook', 698),
 ('2019-10', 'Google', 699),
 ('2019-10', 'Instagram', 707),
 ('2019-10', 'Naver', 713),
 ('2019-10', 'Organic', 709),
 ('2019-10', 'Youtube', 705),
 ('2019-09', 'Facebook', 597),
 ('2019-09', 'Google', 599),
 ('2019-09', 'Instagram', 588),
 ('2019-09', 'Naver', 592),
 ('2019-09', 'Organic', 592),
 ('2019-09', 'Youtube', 588),
 ('2019-08', 'Facebook', 611),
 ('2019-08', 'Google', 610),
 ('2019-08', 'Instagram', 621),
 ('2019-08', 'Naver', 626),
 ('2019-08', 'Organic', 608),
 ('2019-08', 'Youtube', 614),
 ('2019-07', 'Facebook', 558),
 ('2019-07', 'Google', 556),
 ('2019-07', 'Instagram', 567),
 ('2019-07', 'Naver', 553),
 ('2019-07', 'Organic', 557),
 ('2019-07', 'Youtube', 564),
 ('2019-06', 'Facebook', 414),
 ('2019-06', 'Google', 412),
 ('2019-06', 'Instagram', 410),
 ('2019-06', 'Naver', 398),
 ('2019-06', 'Organic', 416),
 ('2019-06', 'Youtube', 400),
 ('2019-05', 'Facebook', 247),
 ('2019-05', 'Google', 253),
 ('2019-05', 'Instagram', 234),
 ('2019-05', 'Naver', 237),
 ('2019-05', 'Organic', 238),
 ('2019-05', 'Youtube', 244)]

## CTAS: SELECT를 가지고 테이블 생성

In [4]:
%%sql

DROP TABLE IF EXISTS adhoc.cyan9212_session_summary;
CREATE TABLE adhoc.cyan9212_session_summary AS 
SELECT B.*, A.ts FROM raw_data.session_timestamp A
JOIN raw_data.user_session_channel B ON A.sessionid = B.sessionid;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
Done.

[]

In [6]:
%%sql

SELECT 
  TO_CHAR(ts, 'YYYY-MM') AS month, 
  COUNT(DISTINCT userid) AS mau
FROM adhoc.cyan9212_session_summary
GROUP BY 1
ORDER BY 1 DESC;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-11', 721),
 ('2019-10', 763),
 ('2019-09', 639),
 ('2019-08', 662),
 ('2019-07', 623),
 ('2019-06', 459),
 ('2019-05', 281)]

## 중복된 레코드 확인

In [7]:
%%sql

SELECT COUNT(1)
FROM adhoc.cyan9212_session_summary

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(101520,)]

In [8]:
%%sql

SELECT COUNT(1)
FROM(
  SELECT DISTINCT userId, sessionId, ts, channel
  FROM adhoc.cyan9212_session_summary
);

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(101520,)]

중복이 없음을 확인할 수 있다.

In [9]:
%%sql

With ds AS(
  SELECT DISTINCT userId, sessionId, ts, channel FROM adhoc.cyan9212_session_summary
)
SELECT COUNT(1)
FROM ds;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(101520,)]

## 최근 데이터의 존재 여부 확인(Freshness Check)

In [11]:
%%sql

SELECT MIN(ts), MAX(ts)
FROM adhoc.cyan9212_session_summary;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(datetime.datetime(2019, 5, 1, 0, 13, 11, 783000), datetime.datetime(2019, 11, 30, 23, 58, 23))]

## Primary key uniqueness가 지켜지는지 확인

In [12]:
%%sql

SELECT sessionId, COUNT(1)
FROM adhoc.cyan9212_session_summary
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[('000a91f3e374e6147d58ed1814247508', 1),
 ('000d0c74074191add6f22e0004db8f76', 1),
 ('001c10d28e514c413b461eae83abdb4b', 1),
 ('000dd3543ac84d906eae52e7c779bb2a', 1),
 ('001d3439223b7bb23ed89b9c8890d096', 1),
 ('00146eefb7aa8cc45a7f321ff2b523ee', 1),
 ('0029840be189e5c1c5667a8843120a08', 1),
 ('001fca6b304504b620c727b498b2d814', 1),
 ('00368789723d67f4d768abd29b985b24', 1),
 ('0025ad7a491d38ca9bb71732255dc01d', 1)]

Primary key uniqueness가 지켜지고 있다.

## 값이 비어있는 Column이 존재하는지 확인

In [13]:
%%sql

SELECT 
  COUNT(CASE WHEN sessionId is NULL THEN 1 END) sessionId_null_count,
  COUNT(CASE WHEN userId is NULL THEN 1 END) userId_null_count,
  COUNT(CASE WHEN ts is NULL THEN 1 END) ts_null_count,
  COUNT(CASE WHEN channel is NULL THEN 1 END) channel_null_count
FROM adhoc.cyan9212_session_summary;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(0, 0, 0, 0)]